; domain
(define (domain driverlog)
  (:requirements :typing)
  (:types         location locatable - object
		driver truck package - locatable

  )
  (:predicates
		(at ?obj - locatable ?loc - location)
		(in ?obj1 - package ?obj - truck)
		(driving ?d - driver ?v - truck)
		(link ?x ?y - location) (path ?x ?y - location)
		(empty ?v - truck)
)


(:action load-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?obj ?loc))
  :effect
   (and (not (at ?obj ?loc)) (in ?obj ?truck)))

(:action unload-truck
  :parameters
   (?loc - location ?obj - package
    ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (in ?obj ?truck))
  :effect
   (and (not (in ?obj ?truck)) (at ?obj ?loc)))

(:action board-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
  :effect
   (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck))))

(:action disembark-truck
  :parameters
   (?driver - driver
    ?loc - location ?truck - truck
    )
  :precondition
   (and (at ?truck ?loc) (driving ?driver ?truck))
  :effect
   (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck)))

(:action drive-truck
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location
    ?truck - truck)
  :precondition
   (and (at ?truck ?loc-from)
   (driving ?driver ?truck) (link ?loc-from ?loc-to))
  :effect
   (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)))

(:action walk
  :parameters
   (?driver - driver
    ?loc-from - location
    ?loc-to - location)
  :precondition
   (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
  :effect
   (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)))


)

; problem
(define (problem DLOG-7-6-30)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	driver6 - driver
	driver7 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	truck5 - truck
	truck6 - truck
	package1 - package
	package2 - package
	package3 - package
	package4 - package
	package5 - package
	package6 - package
	package7 - package
	package8 - package
	package9 - package
	package10 - package
	package11 - package
	package12 - package
	package13 - package
	package14 - package
	package15 - package
	package16 - package
	package17 - package
	package18 - package
	package19 - package
	package20 - package
	package21 - package
	package22 - package
	package23 - package
	package24 - package
	package25 - package
	package26 - package
	package27 - package
	package28 - package
	package29 - package
	package30 - package
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	p1-2 - location
	p1-4 - location
	p2-3 - location
	p3-0 - location
	p4-1 - location
	p4-2 - location
	p4-3 - location
	)
	(:init
	(at driver1 s4)
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s3)
	(at driver5 s3)
	(at driver6 s1)
	(at driver7 s4)
	(at truck1 s0)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s4)
	(empty truck4)
	(at truck5 s4)
	(empty truck5)
	(at truck6 s4)
	(empty truck6)
	(at package1 s0)
	(at package2 s4)
	(at package3 s3)
	(at package4 s1)
	(at package5 s3)
	(at package6 s0)
	(at package7 s3)
	(at package8 s4)
	(at package9 s0)
	(at package10 s2)
	(at package11 s3)
	(at package12 s1)
	(at package13 s0)
	(at package14 s0)
	(at package15 s4)
	(at package16 s3)
	(at package17 s4)
	(at package18 s0)
	(at package19 s1)
	(at package20 s4)
	(at package21 s0)
	(at package22 s2)
	(at package23 s1)
	(at package24 s1)
	(at package25 s3)
	(at package26 s2)
	(at package27 s0)
	(at package28 s0)
	(at package29 s0)
	(at package30 s1)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(path s1 p1-4)
	(path p1-4 s1)
	(path s4 p1-4)
	(path p1-4 s4)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(path s3 p3-0)
	(path p3-0 s3)
	(path s0 p3-0)
	(path p3-0 s0)
	(path s4 p4-2)
	(path p4-2 s4)
	(path s2 p4-2)
	(path p4-2 s2)
	(path s4 p4-3)
	(path p4-3 s4)
	(path s3 p4-3)
	(path p4-3 s3)
	(link s0 s3)
	(link s3 s0)
	(link s0 s4)
	(link s4 s0)
	(link s1 s0)
	(link s0 s1)
	(link s1 s2)
	(link s2 s1)
	(link s1 s3)
	(link s3 s1)
	(link s2 s0)
	(link s0 s2)
	(link s2 s4)
	(link s4 s2)
)
	(:goal (and
	(at driver2 s1)
	(at driver4 s2)
	(at driver5 s4)
	(at driver6 s2)
	(at driver7 s3)
	(at truck1 s0)
	(at truck2 s1)
	(at truck3 s0)
	(at truck5 s1)
	(at package1 s1)
	(at package2 s0)
	(at package3 s2)
	(at package4 s1)
	(at package5 s1)
	(at package6 s4)
	(at package7 s1)
	(at package8 s0)
	(at package9 s0)
	(at package10 s4)
	(at package11 s0)
	(at package12 s4)
	(at package13 s2)
	(at package14 s4)
	(at package15 s2)
	(at package16 s3)
	(at package17 s1)
	(at package19 s2)
	(at package21 s3)
	(at package22 s0)
	(at package23 s0)
	(at package24 s1)
	(at package25 s0)
	(at package26 s4)
	(at package27 s3)
	(at package28 s4)
	))


)

; plan
1. (board-truck driver7 s4 truck4)
   deleted: (at driver7 s4) (empty truck4)
   added: (driving driver7 truck4)
   goals met: 6 of 35
2. (board-truck driver1 s4 truck5)
   deleted: (at driver1 s4) (empty truck5)
   added: (driving driver1 truck5)
   goals met: 6 of 35
3. (drive-truck driver1 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 6 of 35
4. (load-truck s4 package8 truck4)
   deleted: (at package8 s4)
   added: (in package8 truck4)
   goals met: 6 of 35
5. (load-truck s4 package2 truck4)
   deleted: (at package2 s4)
   added: (in package2 truck4)
   goals met: 6 of 35
6. (drive-truck driver7 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 6 of 35
7. (drive-truck driver1 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 7 of 35
8. (drive-truck driver1 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 6 of 35
9. (unload-truck s0 package8 truck4)
   deleted: (in package8 truck4)
   added: (at package8 s0)
   goals met: 7 of 35
10. (load-truck s0 package6 truck4)
   deleted: (at package6 s0)
   added: (in package6 truck4)
   goals met: 7 of 35
11. (load-truck s0 package28 truck4)
   deleted: (at package28 s0)
   added: (in package28 truck4)
   goals met: 7 of 35
12. (load-truck s0 package27 truck4)
   deleted: (at package27 s0)
   added: (in package27 truck4)
   goals met: 7 of 35
13. (load-truck s0 package21 truck4)
   deleted: (at package21 s0)
   added: (in package21 truck4)
   goals met: 7 of 35
14. (drive-truck driver7 s0 s3 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   goals met: 7 of 35
15. (load-truck s3 package7 truck4)
   deleted: (at package7 s3)
   added: (in package7 truck4)
   goals met: 7 of 35
16. (load-truck s3 package5 truck4)
   deleted: (at package5 s3)
   added: (in package5 truck4)
   goals met: 7 of 35
17. (load-truck s3 package3 truck4)
   deleted: (at package3 s3)
   added: (in package3 truck4)
   goals met: 7 of 35
18. (drive-truck driver7 s3 s0 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   goals met: 7 of 35
19. (unload-truck s0 package2 truck4)
   deleted: (in package2 truck4)
   added: (at package2 s0)
   goals met: 8 of 35
20. (load-truck s0 package14 truck4)
   deleted: (at package14 s0)
   added: (in package14 truck4)
   goals met: 8 of 35
21. (load-truck s0 package13 truck4)
   deleted: (at package13 s0)
   added: (in package13 truck4)
   goals met: 8 of 35
22. (drive-truck driver7 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 8 of 35
23. (unload-truck s1 package7 truck4)
   deleted: (in package7 truck4)
   added: (at package7 s1)
   goals met: 9 of 35
24. (unload-truck s1 package5 truck4)
   deleted: (in package5 truck4)
   added: (at package5 s1)
   goals met: 10 of 35
25. (load-truck s1 package23 truck4)
   deleted: (at package23 s1)
   added: (in package23 truck4)
   goals met: 10 of 35
26. (drive-truck driver7 s1 s0 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s0)
   goals met: 10 of 35
27. (unload-truck s0 package23 truck4)
   deleted: (in package23 truck4)
   added: (at package23 s0)
   goals met: 11 of 35
28. (load-truck s0 package1 truck4)
   deleted: (at package1 s0)
   added: (in package1 truck4)
   goals met: 11 of 35
29. (load-truck s2 package26 truck5)
   deleted: (at package26 s2)
   added: (in package26 truck5)
   goals met: 11 of 35
30. (load-truck s2 package22 truck5)
   deleted: (at package22 s2)
   added: (in package22 truck5)
   goals met: 11 of 35
31. (load-truck s2 package10 truck5)
   deleted: (at package10 s2)
   added: (in package10 truck5)
   goals met: 11 of 35
32. (drive-truck driver1 s2 s4 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s4)
   goals met: 11 of 35
33. (unload-truck s4 package26 truck5)
   deleted: (in package26 truck5)
   added: (at package26 s4)
   goals met: 12 of 35
34. (load-truck s4 package17 truck5)
   deleted: (at package17 s4)
   added: (in package17 truck5)
   goals met: 12 of 35
35. (drive-truck driver1 s4 s0 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s0)
   goals met: 12 of 35
36. (drive-truck driver1 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 13 of 35
37. (drive-truck driver7 s0 s2 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s2)
   goals met: 13 of 35
38. (unload-truck s2 package3 truck4)
   deleted: (in package3 truck4)
   added: (at package3 s2)
   goals met: 14 of 35
39. (unload-truck s2 package13 truck4)
   deleted: (in package13 truck4)
   added: (at package13 s2)
   goals met: 15 of 35
40. (drive-truck driver7 s2 s4 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   goals met: 15 of 35
41. (unload-truck s4 package6 truck4)
   deleted: (in package6 truck4)
   added: (at package6 s4)
   goals met: 16 of 35
42. (drive-truck driver7 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 16 of 35
43. (drive-truck driver7 s0 s3 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   goals met: 16 of 35
44. (unload-truck s3 package27 truck4)
   deleted: (in package27 truck4)
   added: (at package27 s3)
   goals met: 17 of 35
45. (load-truck s3 package25 truck4)
   deleted: (at package25 s3)
   added: (in package25 truck4)
   goals met: 17 of 35
46. (drive-truck driver7 s3 s0 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   goals met: 17 of 35
47. (unload-truck s0 package25 truck4)
   deleted: (in package25 truck4)
   added: (at package25 s0)
   goals met: 18 of 35
48. (load-truck s1 package19 truck5)
   deleted: (at package19 s1)
   added: (in package19 truck5)
   goals met: 18 of 35
49. (drive-truck driver1 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 17 of 35
50. (drive-truck driver7 s0 s3 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s3)
   goals met: 17 of 35
51. (unload-truck s3 package21 truck4)
   deleted: (in package21 truck4)
   added: (at package21 s3)
   goals met: 18 of 35
52. (load-truck s3 package11 truck4)
   deleted: (at package11 s3)
   added: (in package11 truck4)
   goals met: 18 of 35
53. (drive-truck driver7 s3 s0 truck4)
   deleted: (at truck4 s3)
   added: (at truck4 s0)
   goals met: 18 of 35
54. (unload-truck s0 package11 truck4)
   deleted: (in package11 truck4)
   added: (at package11 s0)
   goals met: 19 of 35
55. (drive-truck driver7 s0 s4 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s4)
   goals met: 19 of 35
56. (unload-truck s4 package28 truck4)
   deleted: (in package28 truck4)
   added: (at package28 s4)
   goals met: 20 of 35
57. (load-truck s4 package15 truck4)
   deleted: (at package15 s4)
   added: (in package15 truck4)
   goals met: 20 of 35
58. (drive-truck driver7 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 20 of 35
59. (drive-truck driver7 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 20 of 35
60. (load-truck s1 package12 truck4)
   deleted: (at package12 s1)
   added: (in package12 truck4)
   goals met: 20 of 35
61. (drive-truck driver7 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 20 of 35
62. (unload-truck s2 package15 truck4)
   deleted: (in package15 truck4)
   added: (at package15 s2)
   goals met: 21 of 35
63. (drive-truck driver7 s2 s4 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   goals met: 21 of 35
64. (unload-truck s4 package14 truck4)
   deleted: (in package14 truck4)
   added: (at package14 s4)
   goals met: 22 of 35
65. (drive-truck driver7 s4 s0 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s0)
   goals met: 22 of 35
66. (unload-truck s2 package19 truck5)
   deleted: (in package19 truck5)
   added: (at package19 s2)
   goals met: 23 of 35
67. (walk driver4 s3 p2-3)
   deleted: (at driver4 s3)
   added: (at driver4 p2-3)
   goals met: 23 of 35
68. (drive-truck driver1 s2 s0 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s0)
   goals met: 23 of 35
69. (unload-truck s0 package22 truck5)
   deleted: (in package22 truck5)
   added: (at package22 s0)
   goals met: 24 of 35
70. (drive-truck driver1 s0 s1 truck5)
   deleted: (at truck5 s0)
   added: (at truck5 s1)
   goals met: 25 of 35
71. (unload-truck s1 package17 truck5)
   deleted: (in package17 truck5)
   added: (at package17 s1)
   goals met: 26 of 35
72. (walk driver4 p2-3 s2)
   deleted: (at driver4 p2-3)
   added: (at driver4 s2)
   goals met: 27 of 35
73. (walk driver5 s3 p4-3)
   deleted: (at driver5 s3)
   added: (at driver5 p4-3)
   goals met: 27 of 35
74. (walk driver5 p4-3 s4)
   deleted: (at driver5 p4-3)
   added: (at driver5 s4)
   goals met: 28 of 35
75. (walk driver6 s1 p1-2)
   deleted: (at driver6 s1)
   added: (at driver6 p1-2)
   goals met: 28 of 35
76. (drive-truck driver7 s0 s1 truck4)
   deleted: (at truck4 s0)
   added: (at truck4 s1)
   goals met: 28 of 35
77. (unload-truck s1 package1 truck4)
   deleted: (in package1 truck4)
   added: (at package1 s1)
   goals met: 29 of 35
78. (drive-truck driver1 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 28 of 35
79. (drive-truck driver1 s2 s4 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s4)
   goals met: 28 of 35
80. (unload-truck s4 package10 truck5)
   deleted: (in package10 truck5)
   added: (at package10 s4)
   goals met: 29 of 35
81. (drive-truck driver1 s4 s2 truck5)
   deleted: (at truck5 s4)
   added: (at truck5 s2)
   goals met: 29 of 35
82. (drive-truck driver1 s2 s1 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   goals met: 30 of 35
83. (drive-truck driver7 s1 s2 truck4)
   deleted: (at truck4 s1)
   added: (at truck4 s2)
   goals met: 30 of 35
84. (board-truck driver4 s2 truck2)
   deleted: (at driver4 s2) (empty truck2)
   added: (driving driver4 truck2)
   goals met: 29 of 35
85. (disembark-truck driver7 s2 truck4)
   deleted: (driving driver7 truck4)
   added: (at driver7 s2) (empty truck4)
   goals met: 29 of 35
86. (walk driver6 p1-2 s2)
   deleted: (at driver6 p1-2)
   added: (at driver6 s2)
   goals met: 30 of 35
87. (walk driver7 s2 p2-3)
   deleted: (at driver7 s2)
   added: (at driver7 p2-3)
   goals met: 30 of 35
88. (walk driver7 p2-3 s3)
   deleted: (at driver7 p2-3)
   added: (at driver7 s3)
   goals met: 31 of 35
89. (disembark-truck driver4 s2 truck2)
   deleted: (driving driver4 truck2)
   added: (at driver4 s2) (empty truck2)
   goals met: 32 of 35
90. (board-truck driver4 s2 truck4)
   deleted: (at driver4 s2) (empty truck4)
   added: (driving driver4 truck4)
   goals met: 31 of 35
91. (drive-truck driver4 s2 s4 truck4)
   deleted: (at truck4 s2)
   added: (at truck4 s4)
   goals met: 31 of 35
92. (unload-truck s4 package12 truck4)
   deleted: (in package12 truck4)
   added: (at package12 s4)
   goals met: 32 of 35
93. (board-truck driver6 s2 truck2)
   deleted: (at driver6 s2) (empty truck2)
   added: (driving driver6 truck2)
   goals met: 31 of 35
94. (drive-truck driver6 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 32 of 35
95. (drive-truck driver1 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 31 of 35
96. (disembark-truck driver1 s2 truck5)
   deleted: (driving driver1 truck5)
   added: (at driver1 s2) (empty truck5)
   goals met: 31 of 35
97. (board-truck driver1 s2 truck3)
   deleted: (at driver1 s2) (empty truck3)
   added: (driving driver1 truck3)
   goals met: 31 of 35
98. (drive-truck driver1 s2 s0 truck3)
   deleted: (at truck3 s2)
   added: (at truck3 s0)
   goals met: 32 of 35
99. (drive-truck driver6 s1 s2 truck2)
   deleted: (at truck2 s1)
   added: (at truck2 s2)
   goals met: 31 of 35
100. (disembark-truck driver6 s2 truck2)
   deleted: (driving driver6 truck2)
   added: (at driver6 s2) (empty truck2)
   goals met: 32 of 35
101. (board-truck driver6 s2 truck5)
   deleted: (at driver6 s2) (empty truck5)
   added: (driving driver6 truck5)
   goals met: 31 of 35
102. (drive-truck driver6 s2 s1 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   goals met: 32 of 35
103. (walk driver5 s4 p4-2)
   deleted: (at driver5 s4)
   added: (at driver5 p4-2)
   goals met: 31 of 35
104. (drive-truck driver4 s4 s2 truck4)
   deleted: (at truck4 s4)
   added: (at truck4 s2)
   goals met: 31 of 35
105. (walk driver5 p4-2 s2)
   deleted: (at driver5 p4-2)
   added: (at driver5 s2)
   goals met: 31 of 35
106. (disembark-truck driver4 s2 truck4)
   deleted: (driving driver4 truck4)
   added: (at driver4 s2) (empty truck4)
   goals met: 32 of 35
107. (board-truck driver5 s2 truck2)
   deleted: (at driver5 s2) (empty truck2)
   added: (driving driver5 truck2)
   goals met: 32 of 35
108. (drive-truck driver5 s2 s1 truck2)
   deleted: (at truck2 s2)
   added: (at truck2 s1)
   goals met: 33 of 35
109. (drive-truck driver6 s1 s2 truck5)
   deleted: (at truck5 s1)
   added: (at truck5 s2)
   goals met: 32 of 35
110. (disembark-truck driver5 s1 truck2)
   deleted: (driving driver5 truck2)
   added: (at driver5 s1) (empty truck2)
   goals met: 32 of 35
111. (walk driver5 s1 p1-4)
   deleted: (at driver5 s1)
   added: (at driver5 p1-4)
   goals met: 32 of 35
112. (walk driver5 p1-4 s4)
   deleted: (at driver5 p1-4)
   added: (at driver5 s4)
   goals met: 33 of 35
113. (drive-truck driver6 s2 s1 truck5)
   deleted: (at truck5 s2)
   added: (at truck5 s1)
   goals met: 34 of 35
114. (disembark-truck driver6 s1 truck5)
   deleted: (driving driver6 truck5)
   added: (at driver6 s1) (empty truck5)
   goals met: 34 of 35
115. (walk driver6 s1 p1-2)
   deleted: (at driver6 s1)
   added: (at driver6 p1-2)
   goals met: 34 of 35
116. (walk driver6 p1-2 s2)
   deleted: (at driver6 p1-2)
   added: (at driver6 s2)
   goals met: 35 of 35
